Table of Contents
 Class IdeaWorkPlane
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaWorkPlane : AbstractIdeaObject<IIdeaWorkPlane>, IEquatable<AbstractIdeaObject<IIdeaWorkPlane>>, IIdeaWorkPlane, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaWorkPlane>
IdeaWorkPlane
Implements
IEquatable<AbstractIdeaObject<IIdeaWorkPlane>>
IIdeaWorkPlane
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaWorkPlane>.Id
 AbstractIdeaObject<IIdeaWorkPlane>.Name
 AbstractIdeaObject<IIdeaWorkPlane>.Identifier
 AbstractIdeaObject<IIdeaWorkPlane>.GetHashCode()
 AbstractIdeaObject<IIdeaWorkPlane>.Equals(object)
 AbstractIdeaObject<IIdeaWorkPlane>.Equals(AbstractIdeaObject<IIdeaWorkPlane>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaWorkPlane(Identifier<IIdeaWorkPlane>)
protected IdeaWorkPlane(Identifier<IIdeaWorkPlane> identifer)
Parameters
identifer Identifier<IIdeaWorkPlane>
 IdeaWorkPlane(int)
public IdeaWorkPlane(int id)
Parameters
id int
 IdeaWorkPlane(string)
public IdeaWorkPlane(string id)
Parameters
id string
Properties
 Normal
Workplane normal vector
public IdeaVector3D Normal { get; set; }
Property Value
IdeaVector3D
 Origin
Workplane origin point
public virtual IIdeaNode Origin { get; set; }
Property Value
IIdeaNode
 Token
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Edit this page